# Numpy and Pandas

## 1. 기초

In [1]:
import numpy as np
import pandas as pd

라이브러리 import

In [2]:
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/population_sample.csv'
pop = pd.read_csv(path)

pop.head()

   year  household  k_male  k_female  f_male  f_female
0  1981        NaN    4160      4191     NaN       NaN
1  1982        NaN    4160      4191     NaN       NaN
2  1983     2116.0    4160      4191     NaN       NaN
3  1984     2246.0    4160      4191     NaN       NaN
4  1985     2338.0    4788      4838     7.0       6.0

CSV 파일에서 데이터 읽어 오기

In [5]:
pop.shape

(42, 6)

데이터프레임 모양 확인 -> (행수, 열수)

In [6]:
pop.info() # 인덱스, 열, 값, 개수, 데이터 형식 정보 등 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   year       42 non-null     int64
 1   household  40 non-null     float64
 2   k_male     42 non-null     int64
 3   k_female   42 non-null     int64
 4   f_male     38 non-null     float64
 5   f_female   38 non-null     float64
dtypes: float64(3), int64(3)
memory usage: 2.1 KB

In [7]:
pop.describe() # 기초 통계 정보 확인

,year,household,k_male,k_female,f_male,f_female
count,42.000000,40.000000,42.00000,42.000000,38.000000,38.000000
mean,2001.500000,3617.200000,4979.00000,5033.738095,67.552632,72.578947
std,12.267844,667.786285,344.36141,307.954468,50.758941,57.153483
min,1981.000000,2116.000000,4160.00000,4191.000000,5.000000,4.000000
25%,1991.250000,3419.000000,4841.75000,4986.750000,21.750000,19.500000
50%,2001.500000,3669.500000,5062.00000,5121.000000,51.500000,57.500000
75%,2011.750000,4190.000000,5153.75000,5153.000000,121.000000,133.500000
max,2022.000000,4446.000000,5500.00000,5435.000000,137.000000,148.000000

In [10]:
path = 'https://raw.githubusercontent.com/DA4BAM/dataset/master/titanic_simple.csv'
titanic = pd.read_csv(path)

titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,7.2500,Southampton
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,71.2833,Cherbourg
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,7.9250,Southampton
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,53.1000,Southampton
4,5,0,3,"Allen, Mr. William Henry",male,35.0,8.0500,Southampton

In [14]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   Fare         891 non-null    float64
 7   Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 55.8+ KB

In [17]:
titanic.loc[titanic['Survived'] == 0].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 549 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  549 non-null    int64
 1   Survived     549 non-null    int64
 2   Pclass       549 non-null    int64
 3   Name         549 non-null    object
 4   Sex          549 non-null    object
 5   Age          424 non-null    float64
 6   Fare         549 non-null    float64
 7   Embarked     549 non-null    object
dtypes: float64(2), int64(3), object(3)
memory usage: 38.6+ KB

`.loc`: 조건으로 조회

In [13]:
titanic.loc[:, ['Survived','Fare']]

     Survived     Fare
0           0   7.2500
1           1  71.2833
2           1   7.9250
3           1  53.1000
4           0   8.0500
..        ...      ...
886         0  13.0000
887         1  30.0000
888         0  23.4500
889         1  30.0000
890         0   7.7500

[891 rows x 2 columns]

특정 열 이름만 지정해서, 모든 행을 가져오기

### (+) 편리한 메소드

`isin()`, `betwwen()`

### (+) 집계 함수

- `sum()`
- `mean()`
- `max()`
- `min()`
- `count()`

In [25]:
titanic.groupby('Sex', as_index=True)['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

In [27]:
titanic.groupby('Sex', as_index=True)[['Survived']].sum()

        Survived
Sex
female       233
male         109

집계대상변수(`Survived`)를 다시 `[]`로 한 번 더 감싸니까, 결과가 데이터프레임으로 나타나는구나~

In [30]:
titanic.groupby('Sex', as_index=False)['Survived'].sum()

      Sex  Survived
0  female       233
1    male       109

헐. 이렇게 해도 데이터프레임으로 나타나는구나~

In [31]:
titanic.groupby(['Sex', 'Survived'], as_index=False)[['Fare','Pclass']].sum()

      Sex  Survived        Fare  Pclass
0  female         0   1864.9752     231
1  female         1  12101.6876     447
2    male         0  10277.7447    1159
3    male         1   4449.5418     220

- 집계 대상 열을 리스트로 지정 가능
- 집계 기준 열을 여럿 설정 가능

In [36]:
# 'Survived' 별 'Age'의 합계, 평균, 최댓값, 최솟값
titanic.groupby('Survived')['Age'].agg(['sum','mean','max','min'])

               sum       mean   max   min
Survived
0         12985.50  30.626179  74.0  1.00
1          8219.67  28.343690  80.0  0.42

`.agg()` 메소드로 다양한 집계
- 여러 열에 대해 한 번에 집계 가능

In [39]:
titanic.groupby('Survived')[['Age','Fare']].agg(['sum','mean','max','min'])

               Age                               Fare                       \
               sum       mean   max   min         sum       mean       max
Survived
0         12985.50  30.626179  74.0  1.00  12142.7199  22.117887  263.0000
1          8219.67  28.343690  80.0  0.42  16551.2294  48.395408  512.3292


          min
Survived
0         0.0
1         0.0

오오~
이런식으로 리스트를 전달하여, **여러 열에 대해 여러 집계를 한 번에 수행 가능**

In [42]:
titanic.groupby('Survived', as_index=False).agg({'Fare':'sum','Fare':'mean','Age':'max','Age':'min'})

   Survived       Fare   Age
0         0  22.117887  1.00
1         1  48.395408  0.42

헐.

그리고 이런식으로, **여러 열에 대한 집계를 각 열마다 따로, 다른 집계로, 한 번에 수행 가능**